:PROPERTIES:
:ID:       8f26da40-c5cb-4c37-9893-b1999c58366c
:END:
#+TITLE: Running CI tests like production
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes 

I got burned last month: my tests passed in CI but the app crashed in
production because of a file permission bug. The tests ran as root,
but production runs as a regular user. I want my CI containers to use
the same non-root user as production so I catch these issues early.

First I set up my Dagger project and install daggerlib:

#+begin_src bash :eval no-export :init yes
dagger init --sdk=python
dagger install github.com/Konubinix/daggerlib
#+end_src

#+RESULTS[c4efdd5f981c9514f8ec08a7690bee71d70c7f38]:

The following is only for testing purposes — it makes the project
use the local daggerlib checkout instead of the published version:

#+begin_src bash :eval no-export :init yes
sed -i '/pin/d; s|"github.com/Konubinix/daggerlib@main"|"../.."|; s|"\.\./\.\.",|"../.."|' dagger.json
#+end_src

#+RESULTS[c0e43fe49406c11e84dec1670d2236fec6890c1b]:


Then I write my Dagger module. Each =<<...>>= reference is defined in
the sections below — they show the function code and its output:

#+begin_src python :tangle .dagger/src/non_root_user/main.py :noweb yes
import dagger
from dagger import dag, function, object_type


@object_type
class NonRootUser:
    <<whoami-check>>
    <<home-check>>
    <<uid-check>>
    <<debian-uid-check>>
#+end_src

* Matching the production UID

  Our Kubernetes pods run with UID 1000. I need the CI user to have
  the same UID so that volume mounts and file ownership behave
  identically:

  #+NAME: uid-check
  #+begin_src python
  @function
  async def uid_check(self) -> str:
      """Check the user has UID 1000."""
      return await (
          dag.lib().alpine_user()
          .with_exec(['id', 'sam'])
          .stdout()
      )
  #+end_src

  #+NAME: alpine_user_id
  #+begin_src bash :tangle (daggerlib-tangle-test "alpine_user_id") :comments no :padline no
  dagger call uid-check
  #+end_src

  #+RESULTS[58a4db234090db9013989cc071c6cb85b318138f]: alpine_user_id
  : uid=1000(sam) gid=1000(sam) groups=1000(sam),1000(sam)

  #+BEGIN_SRC org :tangle (daggerlib-tangle-expected "alpine_user_id") :noweb yes :exports none :comments no :padline no
  <<alpine_user_id()>>
  #+END_SRC

* Some tests need Debian for native libraries

  A few integration tests link against =libpq=, which is easier on
  Debian. Same non-root guarantee:

  #+NAME: debian-uid-check
  #+begin_src python
  @function
  async def debian_uid_check(self) -> str:
      """Check the Debian user has UID 1000."""
      return await (
          dag.lib().debian_user()
          .with_exec(['id', 'sam'])
          .stdout()
      )
  #+end_src

  #+NAME: debian_user_id
  #+begin_src bash :tangle (daggerlib-tangle-test "debian_user_id") :comments no :padline no
  dagger call debian-uid-check
  #+end_src

  #+RESULTS[a72846981884ed574d5c72b72bdd09d850a06c9f]: debian_user_id
  : uid=1000(sam) gid=1000(sam) groups=1000(sam),100(users)

  #+BEGIN_SRC org :tangle (daggerlib-tangle-expected "debian_user_id") :noweb yes :exports none :comments no :padline no
  <<debian_user_id()>>
  #+END_SRC
